<!-- dflook/terraform-github-actions {"workspace":"test-destroy-lock-info-2","backend_type":"remote","backend":"57d7fdafd15d41a8cd0915ae30d2f469a29e87f7b423166bd0f5fa0a52f49589","plan_job_ref":"Job Test Terraform cloud #133 at https://github.com/dflook/terraform-github-actions/actions/runs/4031732501","plan_hash":"28a7eb78e6a5334638dca9b98cc9b0fa3855c793bf878acb9e794089d487289b","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __test-destroy-lock-info-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #133](https://github.com/dflook/terraform-github-actions/actions/runs/4031732501)